CSI API ETABS v1
eMatTypeConcrete Enumeration
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eMatTypeConcrete
Public Enumeration eMatTypeConcrete
Dim instance As eMatTypeConcrete
public enum class eMatTypeConcrete
type eMatTypeConcrete
Members
Member name | Value | Description
FC3000_NormalWeight | 1
FC4000_NormalWeight | 2
FC5000_NormalWeight | 3
FC6000_NormalWeight | 4
FC3000_LightWeight | 5
FC4000_LightWeight | 6
FC5000_LightWeight | 7
FC6000_LightWeight | 8
Chinese_C20_NormalWeight | 9
Chinese_C30_NormalWeight | 10
Chinese_C40_NormalWeight | 11
Indian_M15_NormalWeight | 12
Indian_M20_NormalWeight | 13
Indian_M25_NormalWeight | 14
Indian_M30_NormalWeight | 15
Indian_M35_NormalWeight | 16
Indian_M40_NormalWeight | 17
Indian_M45_NormalWeight | 18
Indian_M50_NormalWeight | 19
Indian_M55_NormalWeight | 20
Indian_M60_NormalWeight | 21
EN_C12_NormalWeight | 22
EN_C16_NormalWeight | 23
EN_C20_NormalWeight | 24
EN_C25_NormalWeight | 25
EN_C30_NormalWeight | 26
EN_C35_NormalWeight | 27
EN_C40_NormalWeight | 28
EN_C45_NormalWeight | 29
EN_C50_NormalWeight | 30
EN_C55_NormalWeight | 31
EN_C60_NormalWeight | 32
EN_C70_NormalWeight | 33
EN_C80_NormalWeight | 34
EN_C90_NormalWeight | 35
See Also
Reference
ETABSv1 Namespace